// eslint-disable-next-line no-undef
export default defineEventHandler(() => {
  return [
    {
      id: 1,
      title: 'Разработка Корпоративного Веб-портала',
      person: 'team',
      price: 479000,
      min_period: 60,
      max_period: 80,
      categories: [
        {
          id: 1,
          name: 'Категория 1'
        },
        {
          id: 2,
          name: 'Категория 2'
        }
      ],
      keywords: ['E-commerce', 'Frontend', 'UX/UI'],
      technologies: [
        {
          id: 1,
          name: 'Vue.js',
          img: 'JavaScript'
        },
        {
          id: 2,
          name: 'CSS',
          img: 'CSS'
        },
        {
          id: 3,
          name: 'HTML',
          img: 'HTML'
        }
      ],
      description:
        'Идейные соображения высшего порядка, а также сложившаяся структура организации влечет за собой процесс от внедрения и модернизации систем массового участия. Разнообразный и богатый опыт дальнейшее развитие. Идейные соображения высшего порядка, а также сложившаяся структура организации влечет за собой процесс как вне дрения и модернизации систем массового участия. Разнообразный и богатый опыт дальнейшее развитие. Так по Идейные соображения высшего порядка, а также сложившаяся структура организации влечет за собой процесс внедрения и модернизации систем массового участия. Разнообразный и богатый опыт дальнейшее развитие. Идейные соображения высшего порядка, а также сложившаяся структура организации влечет за собой процесс внедрения и модернизации систем массового участия.',
      employee: {
        avatar: 'aaa',
        first_name: 'Паша',
        last_name: 'Бамбук',
        responses: 12,
        min_period: 1,
        max_period: 999
      }
    },
    {
      id: 2,
      title: 'Разработка Корпоративного Веб-портала',
      person: 'team',
      price: 479000,
      min_period: 60,
      max_period: 80,
      categories: [
        {
          id: 1,
          name: 'Категория 1'
        },
        {
          id: 2,
          name: 'Категория 2'
        }
      ],
      keywords: ['E-commerce', 'Frontend', 'UX/UI'],
      technologies: [
        {
          id: 1,
          name: 'Vue.js',
          img: 'JavaScript'
        },
        {
          id: 2,
          name: 'CSS',
          img: 'CSS'
        },
        {
          id: 3,
          name: 'HTML',
          img: 'HTML'
        }
      ],
      description:
        'Идейные соображения высшего порядка, а также сложившаяся структура организации влечет за собой процесс от внедрения и модернизации систем массового участия. Разнообразный и богатый опыт дальнейшее развитие. Идейные соображения высшего порядка, а также сложившаяся структура организации влечет за собой процесс как вне дрения и модернизации систем массового участия. Разнообразный и богатый опыт дальнейшее развитие. Так по Идейные соображения высшего порядка, а также сложившаяся структура организации влечет за собой процесс внедрения и модернизации систем массового участия. Разнообразный и богатый опыт дальнейшее развитие. Идейные соображения высшего порядка, а также сложившаяся структура организации влечет за собой процесс внедрения и модернизации систем массового участия.',
      employee: {
        avatar: 'aaa',
        first_name: 'Паша',
        last_name: 'Бамбук',
        responses: 12,
        min_period: 1,
        max_period: 999
      }
    },
    {
      id: 3,
      title: 'Разработка Корпоративного Веб-портала',
      person: 'solo',
      price: 479000,
      min_period: 60,
      max_period: 80,
      categories: [
        {
          id: 1,
          name: 'Категория 1'
        },
        {
          id: 2,
          name: 'Категория 2'
        }
      ],
      keywords: ['E-commerce', 'Frontend', 'UX/UI'],
      technologies: [
        {
          id: 1,
          name: 'Vue.js',
          img: 'JavaScript'
        },
        {
          id: 2,
          name: 'CSS',
          img: 'CSS'
        },
        {
          id: 3,
          name: 'HTML',
          img: 'HTML'
        }
      ],
      description:
        'Идейные соображения высшего порядка, а также сложившаяся структура организации влечет за собой процесс от внедрения и модернизации систем массового участия. Разнообразный и богатый опыт дальнейшее развитие. Идейные соображения высшего порядка, а также сложившаяся структура организации влечет за собой процесс как вне дрения и модернизации систем массового участия. Разнообразный и богатый опыт дальнейшее развитие. Так по Идейные соображения высшего порядка, а также сложившаяся структура организации влечет за собой процесс внедрения и модернизации систем массового участия. Разнообразный и богатый опыт дальнейшее развитие. Идейные соображения высшего порядка, а также сложившаяся структура организации влечет за собой процесс внедрения и модернизации систем массового участия.',
      employee: {
        avatar: 'aaa',
        first_name: 'Паша',
        last_name: 'Бамбук',
        responses: 12,
        min_period: 1,
        max_period: 999
      }
    },
    {
      id: 4,
      title: 'Разработка Корпоративного Веб-портала',
      person: 'solo',
      price: 479000,
      min_period: 60,
      max_period: 80,
      categories: [
        {
          id: 1,
          name: 'Категория 1'
        },
        {
          id: 2,
          name: 'Категория 2'
        }
      ],
      keywords: ['E-commerce', 'Frontend', 'UX/UI'],
      technologies: [
        {
          id: 1,
          name: 'Vue.js',
          img: 'JavaScript'
        },
        {
          id: 2,
          name: 'CSS',
          img: 'CSS'
        },
        {
          id: 3,
          name: 'HTML',
          img: 'HTML'
        }
      ],
      description:
        'Идейные соображения высшего порядка, а также сложившаяся структура организации влечет за собой процесс от внедрения и модернизации систем массового участия. Разнообразный и богатый опыт дальнейшее развитие. Идейные соображения высшего порядка, а также сложившаяся структура организации влечет за собой процесс как вне дрения и модернизации систем массового участия. Разнообразный и богатый опыт дальнейшее развитие. Так по Идейные соображения высшего порядка, а также сложившаяся структура организации влечет за собой процесс внедрения и модернизации систем массового участия. Разнообразный и богатый опыт дальнейшее развитие. Идейные соображения высшего порядка, а также сложившаяся структура организации влечет за собой процесс внедрения и модернизации систем массового участия.',
      employee: {
        avatar: 'aaa',
        first_name: 'Паша',
        last_name: 'Бамбук',
        responses: 12,
        min_period: 1,
        max_period: 999
      }
    },
    {
      id: 5,
      title: 'Разработка Корпоративного Веб-портала',
      person: 'team',
      price: 479000,
      min_period: 60,
      max_period: 80,
      categories: [
        {
          id: 1,
          name: 'Категория 1'
        },
        {
          id: 2,
          name: 'Категория 2'
        }
      ],
      keywords: ['E-commerce', 'Frontend', 'UX/UI'],
      technologies: [
        {
          id: 1,
          name: 'Vue.js',
          img: 'JavaScript'
        },
        {
          id: 2,
          name: 'CSS',
          img: 'CSS'
        },
        {
          id: 3,
          name: 'HTML',
          img: 'HTML'
        }
      ],
      description:
        'Идейные соображения высшего порядка, а также сложившаяся структура организации влечет за собой процесс от внедрения и модернизации систем массового участия. Разнообразный и богатый опыт дальнейшее развитие. Идейные соображения высшего порядка, а также сложившаяся структура организации влечет за собой процесс как вне дрения и модернизации систем массового участия. Разнообразный и богатый опыт дальнейшее развитие. Так по Идейные соображения высшего порядка, а также сложившаяся структура организации влечет за собой процесс внедрения и модернизации систем массового участия. Разнообразный и богатый опыт дальнейшее развитие. Идейные соображения высшего порядка, а также сложившаяся структура организации влечет за собой процесс внедрения и модернизации систем массового участия.',
      employee: {
        avatar: 'aaa',
        first_name: 'Паша',
        last_name: 'Бамбук',
        responses: 12,
        min_period: 1,
        max_period: 999
      }
    },
    {
      id: 6,
      title: 'Разработка Корпоративного Веб-портала',
      person: 'solo',
      price: 479000,
      min_period: 60,
      max_period: 80,
      categories: [
        {
          id: 1,
          name: 'Категория 1'
        },
        {
          id: 2,
          name: 'Категория 2'
        }
      ],
      keywords: ['E-commerce', 'Frontend', 'UX/UI'],
      technologies: [
        {
          id: 1,
          name: 'Vue.js',
          img: 'JavaScript'
        },
        {
          id: 2,
          name: 'CSS',
          img: 'CSS'
        },
        {
          id: 3,
          name: 'HTML',
          img: 'HTML'
        }
      ],
      description:
        'Идейные соображения высшего порядка, а также сложившаяся структура организации влечет за собой процесс от внедрения и модернизации систем массового участия. Разнообразный и богатый опыт дальнейшее развитие. Идейные соображения высшего порядка, а также сложившаяся структура организации влечет за собой процесс как вне дрения и модернизации систем массового участия. Разнообразный и богатый опыт дальнейшее развитие. Так по Идейные соображения высшего порядка, а также сложившаяся структура организации влечет за собой процесс внедрения и модернизации систем массового участия. Разнообразный и богатый опыт дальнейшее развитие. Идейные соображения высшего порядка, а также сложившаяся структура организации влечет за собой процесс внедрения и модернизации систем массового участия.',
      employee: {
        avatar: 'aaa',
        first_name: 'Паша',
        last_name: 'Бамбук',
        responses: 12,
        min_period: 1,
        max_period: 999
      }
    }
  ];
});
